2024-07-26-useful-tools-recommended.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="汇总一些实用的工具、软件、网站，长期更新">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.vandee.art/rss.xml"
      title="RSS feed for https://www.vandee.art/">
<title>实用小玩意收集</title>
<meta property="og:title" content="实用小玩意收集">
<meta property="og:type" content="article" />
<meta property="og:description" content="汇总一些实用的工具、软件、网站，长期更新">
<meta property="og:url" content="https://www.vandee.art/2024-07-26-useful-tools-recommended.html">
<meta name="author" content="Vandee">
       <meta name="referrer" content="no-referrer">
       <meta name="viewport" content="width=device-width, initial-scale=1.0">

       <link rel="stylesheet" href="assets/css/style.css" type="text/css"/>
       <link rel="stylesheet"
             href="https://lf26-cdn-tos.bytecdntp.com/cdn/expire-1-M/font-awesome/6.0.0/css/all.min.css"/>
       <link rel="stylesheet"
             href="https://testingcf.jsdelivr.net/npm/@fancyapps/ui@4.0.12/dist/fancybox.css"/>
       <link rel="icon" type="image/x-icon" href="/static/favicon.ico"/>


</head>
<body>
<div id="preamble" class="status">
      <header>
      <h1><a href="https://www.vandee.art/">Vandee's Blog</a></h1>
      <nav>
      <a href="https://www.vandee.art/">Home</a>
      <a href="https://x.vandee.art/wiki">Wiki</a>
      <a href="https://x.vandee.art/photo">Photo</a>
      <a href="archive.html">Archive</a>
      <a href="tags.html">Tags</a>
      <div id="search-container">
        <input type="text" id="search-input" placeholder="e.g. Emacs PKM...">
        <i class="fas fa-search search-icon"></i>
      </div>
      </nav>
      </header></div>
<div id="content">
<div class="post-date">26 Jul 2024</div><h1 class="post-title"><a href="https://www.vandee.art/2024-07-26-useful-tools-recommended.html">实用小玩意收集</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org404ae1c">My Favorites</a></li>
<li><a href="#org2c05d16">Mac</a></li>
<li><a href="#orgb7cdb34">Search</a></li>
<li><a href="#orgfc7a2d5">论文</a></li>
<li><a href="#orgf006843">LLM Web Chat</a></li>
<li><a href="#orgede8010">Others</a>
<ul>
<li><a href="#org0951e8c">PDF相关</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
汇总一些实用的工具、软件、网站，长期更新。
</p>

<p>
阮一峰的GitHub weekly issues： <a href="https://github.com/ruanyf/weekly/issues">https://github.com/ruanyf/weekly/issues</a> ，可以找到许多有意思的东西。
</p>

<p>
日常的搜集第一次整理之后有了工具汇总表格版：<a href="https://app.teable.io/share/shrlzO2q7vyCEJYvXqa/view">tools</a> ，这里做第二次筛选。
</p>

<div id="outline-container-org404ae1c" class="outline-2">
<h2 id="org404ae1c">My Favorites</h2>
<div class="outline-text-2" id="text-org404ae1c">
<ul class="org-ul">
<li><p>
<b>Vimium</b>
</p>

<p>
浏览器插件，可以用 Vim 模式来操作浏览器。最喜欢它的快速打开地址栏功能，兼并自定义搜索。在 Firefox 里，自定义了垂直标签栏，再加上这个，还要什么 Arc？
</p></li>
<li><p>
<b>RIME</b>
</p>

<p>
输入法就是笔。
</p>

<p>
<a href="https://rime.im/">RIME | 中州韻輸入法引擎</a>，配合 <a href="https://github.com/iDvel/rime-ice">iDvel/rime-ice: Rime 配置：雾凇拼音 | 长期维护的简体词库</a>，多平台多端同步。已经使用了几年，非常巴适，手机端也可以同步配置。
</p>

<p>
以前输入法就各种偷偷记录用户输入习惯，现在各个输入法又还要内置AI再记录一遍。本地配置、不需要联网的输入法是我的刚需，更何况，rime还可以自挂词库。
</p></li>

<li><p>
<b>Napkin</b>
</p>

<p>
一个可以根据文字内容生成关系图的在线笔记编辑工具，目前还在beta测试阶段可以免费体验PRO的内容，生产力提高不是一点点。生成的关系图可以再详细编辑标题，图标等等，支持导出为PNG、SVG、PDF。
</p>

<p>
Url：<a href="https://www.napkin.ai/">https://www.napkin.ai/</a>
</p></li>
<li><p>
<b>Witsy</b>
</p>

<p>
这就是目前我用过最好的 LLM PC 客户端。
</p>

<p>
Url: <a href="https://github.com/nbonamy/witsy">https://github.com/nbonamy/witsy</a>
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org2c05d16" class="outline-2">
<h2 id="org2c05d16">Mac</h2>
<div class="outline-text-2" id="text-org2c05d16">
<ul class="org-ul">
<li><p>
FlashSpace: FlashSpace is a blazingly fast virtual workspace manager for macOS
</p>

<p>
Github: <a href="https://github.com/wojciech-kulik/FlashSpace">https://github.com/wojciech-kulik/FlashSpace</a>
</p>

<p>
一个简单易用的管理工作区的项目，自定义快捷键就可以切换不同的工作区。平常把 Emacs 和浏览器单独放一个，终端单独放一个。
</p></li>
<li><p>
Maccy：简单易用的剪切板管理工具
</p>

<p>
GitHub：<a href="https://github.com/p0deje/Maccy">https://github.com/p0deje/Maccy</a>
</p></li>
<li><p>
Pearcleaner: A free, source-available and fair-code licensed mac app cleaner
</p>

<p>
Github: <a href="https://github.com/alienator88/Pearcleaner">https://github.com/alienator88/Pearcleaner</a>
</p>

<p>
轻量的软件卸载工具。
</p></li>
<li><p>
<b>PixPin</b>
</p>

<p>
Mac的终于出来了。这是我用过最好用的截图软件了。
</p>

<p>
Url: <a href="https://pixpinapp.com/">https://pixpinapp.com/</a>
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orgb7cdb34" class="outline-2">
<h2 id="orgb7cdb34">Search</h2>
<div class="outline-text-2" id="text-orgb7cdb34">
<ul class="org-ul">
<li><p>
<b>Gemini-Search</b>
</p>

<p>
Perplexity style AI Search engine clone built with Gemini 2.0 Flash and Grounding
</p>

<p>
<a href="https://github.com/ammaarreshi/Gemini-Search">https://github.com/ammaarreshi/Gemini-Search</a>
</p></li>
<li><p>
<b>OpenSearch GPT</b>
</p>

<p>
A personalised AI search engine that learns about you and your interests as you browse the web.It's like a perplexity / searchGPT clone, but for <b>you</b>.
</p>

<p>
开源AI 搜索引擎，使用了mem0来存储记忆。部署在Cloudflare上，作者仅用了一天制作完成。
</p>

<p>
Url: <a href="https://opensearch-ai.pages.dev/">https://opensearch-ai.pages.dev/</a>
</p>

<p>
GitHub: <a href="https://github.com/supermemoryai/opensearch-ai">https://github.com/supermemoryai/opensearch-ai</a>
</p>

<p>
Twitter: <a href="https://x.com/DhravyaShah/status/1818469911490162784">https://x.com/DhravyaShah/status/1818469911490162784</a>
</p>

<p>
<a href="https://github.com/Dhravya/cloudflare-saas-stack">https://github.com/Dhravya/cloudflare-saas-stack</a>  这是作者的之前的Cloudflare全栈方案。
</p></li>

<li><p>
<b>Perplexica</b>
</p>

<p>
GitHub: <a href="https://github.com/ItzCrazyKns/Perplexica">https://github.com/ItzCrazyKns/Perplexica</a>
</p>

<p>
perplexity的开源平替，GitHub 11.4K Star。可docker部署，支持ollama本地模型。由于它的网络搜索依赖于SearXNG，等于还附送了一个SearXNG的本地实例。
</p></li>

<li><p>
<b>Grep</b>
</p>

<p>
一个快速从GitHub仓库查找内容的网站，支持正则，可以直接搜索代码内容
</p>

<p>
Url: <a href="https://grep.app/">https://grep.app/</a>
</p></li>

<li><p>
<b>devv.ai</b>
</p>

<p>
程序员搜索利器
</p>

<p>
<a href="https://devv.ai/zh">https://devv.ai/zh</a>
</p></li>

<li><p>
<b>mwmbl</b>
</p>

<p>
一个可以由用户提供爬取源的开源搜索引擎，github 文档里还介绍了其他许多优秀的搜索引擎
<a href="https://mwmbl.org/">https://mwmbl.org/</a>
</p>

<p>
GitHub: <a href="https://github.com/mwmbl/mwmbl">https://github.com/mwmbl/mwmbl</a>
</p></li>

<li><p>
<b>SearchGPT</b>
</p>

<p>
OpenAI推出的搜索。
</p>

<p>
<a href="https://openai.com/index/searchgpt-prototype/">https://openai.com/index/searchgpt-prototype/</a>
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgfc7a2d5" class="outline-2">
<h2 id="orgfc7a2d5">论文</h2>
<div class="outline-text-2" id="text-orgfc7a2d5">
<ul class="org-ul">
<li><p>
alphaxiv：斯坦福大学的学生做的一个论文讨论平台。可以理解为基于arXiv论文的Twitter，可以对论文评论，讨论。
</p>

<p>
If you find a paper on arXiv that you’d like to discuss, simply replace arxiv.org with alphaxiv.org in the URL.
</p>

<p>
Url：<a href="https://www.alphaxiv.org/">https://www.alphaxiv.org/</a>
</p></li>

<li><a href="https://www.aminer.cn/">AI论文检索平台 aminer</a></li>

<li><p>
<a href="https://paperswithcode.com/">paper with code</a>
</p>

<p>
这是一个论文和对应工程实现（含代码、数据集、测试方法等）的索引工具。下次你看到别人推荐优质论文时，可以直接用它去找代码实现
</p></li>

<li><a href="https://www.connectedpapers.com/">Connected Papers | Find and explore academic papers</a></li>

<li><a href="https://briefgpt.xyz/">BriefGPT - AI 论文速递</a>  一个中文论文推送网站，还可以</li>

<li><p>
Intro: 一个非常好用的AI论文阅读工具：TXYZ
</p>

<p>
Source:  <a href="https://www.txyz.ai/">https://www.txyz.ai/</a>
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgf006843" class="outline-2">
<h2 id="orgf006843">LLM Web Chat</h2>
<div class="outline-text-2" id="text-orgf006843">
<ul class="org-ul">
<li><p>
<b>DuckDuckGo AI Chat</b>
</p>

<p>
DuckDuckGo推出的AI聊天网页。已更新GPT-4o。
</p>

<p>
<a href="https://duckduckgo.com/?q=DuckDuckGo&amp;ia=chat&amp;atb=v409-1">https://duckduckgo.com/?q=DuckDuckGo&amp;ia=chat&amp;atb=v409-1</a>
</p></li>

<li><p>
<b>HuggingChat</b>
</p>

<p>
HuggingFace推出的AI聊天网页，支持最新的Llama 3.1-405B。
</p>

<p>
<a href="https://huggingface.co/chat/">https://huggingface.co/chat/</a>
</p></li>

<li><p>
<b>POE</b>
</p>

<p>
一个聚合LLM聊天网站，可选择的模型很多，Flux也有。
</p>

<p>
<a href="https://poe.com/">https://poe.com/</a>
</p></li>

<li><p>
<b>delve</b>
</p>

<p>
一个可以根据回答内容递进搜索的AI聊天网页。
</p>

<p>
<a href="https://delve.a9.io/">https://delve.a9.io/</a>
</p></li>

<li><p>
<b>WinGPT</b>
</p>

<p>
一个仿window风格的AI聊天网页，免费GPT-4o。
</p>

<p>
<a href="https://wingpt.vercel.app/">https://wingpt.vercel.app/</a>
</p></li>

<li><p>
<b>ChatGPT-Next-Web</b>
</p>

<p>
很早一批开始做GPT生意的了，他们这还可以买KEY。
</p>

<p>
A cross-platform ChatGPT/Gemini UI (Web / PWA / Linux / Win / MacOS). 一键拥有你自己的跨平台 ChatGPT/Gemini 应用。
</p>

<p>
在 1 分钟内使用 Vercel **免费一键部署**个人的GPT聊天实例。
</p>

<p>
GitHub: <a href="https://github.com/ChatGPTNextWeb/ChatGPT-Next-Web">https://github.com/ChatGPTNextWeb/ChatGPT-Next-Web</a>
</p></li>

<li><p>
<b>Open WebUI</b>
</p>

<p>
Open WebUI 是一个可扩展、功能丰富且用户友好的自托管 WebUI，旨在完全离线操作。它支持各种 LLM 运行程序，包括 Ollama 和 OpenAI 兼容的 API。
</p>

<p>
docker轻松部署。
</p>

<p>
GitHub: <a href="https://github.com/open-webui/open-webui">https://github.com/open-webui/open-webui</a>
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgede8010" class="outline-2">
<h2 id="orgede8010">Others</h2>
<div class="outline-text-2" id="text-orgede8010">
<p>
另见：表格版 <a href="https://app.teable.io/share/shrlzO2q7vyCEJYvXqa/view">tools</a>
</p>

<ul class="org-ul">
<li><p>
Intro: 一个电子书翻译工具，7K star.利用大语言模型（如 ChatGPT、Claude 等）对文件和图书进行多语言翻译的制作，支持的格式有 epub、txt 以及 srt 等。最近，作者将之前吴恩达老师开源的翻译工作流整合到项目中，使得翻译的效果更加好。
</p>

<p>
Source: <a href="https://github.com/yihong0618/bilingual_book_maker">https://github.com/yihong0618/bilingual_book_maker</a>
</p></li>

<li><p>
GitHub 上一个开源的终端 AI 助手 AI Shell。
</p>

<p>
在终端命令行界面（CLI）上，可通过自然语言转换为对应执行的 Shell 命令，类似于 GitHub Copilot X CLI。
</p>

<p>
GitHub：<a href="https://github.com/BuilderIO/ai-shell">https://github.com/BuilderIO/ai-shell</a>
</p></li>

<li><p>
Stirling-PDF
</p>

<p>
一个本地的处理 PDF 的工具，界面是 Web UI，可以支持 Docker 部署。
</p>

<p>
各种主要的 PDF 操作都可以支持。比如拆分、合并、转换格式、重新排列、添加图片、旋转、压缩等等。这个本地托管的网络应用最初完全由 ChatGPT 制作，后来逐渐发展，增加了许多功能，以满足你对 PDF 的各种需求。
</p>

<p>
Stirling PDF 不会对外发送任何数据以进行记录或跟踪。
</p>

<p>
所有的文件和 PDF 要么只在客户端处理，要么只在服务器内存中暂存，用于执行任务，或者仅在执行任务时保存在临时文件中。一旦用户下载了文件，那些文件就会从服务器上删除。
</p>

<p>
<a href="https://github.com/Stirling-Tools/Stirling-PDF">https://github.com/Stirling-Tools/Stirling-PDF</a>
</p></li>

<li><p>
部署deeplx到cloudflare，比部署到docker方便
</p>

<p>
<a href="https://github.com/ifyour/deeplx-for-cloudflare">https://github.com/ifyour/deeplx-for-cloudflare</a>
</p></li>

<li><p>
功能颇为强大的 GPT 学术优化开源项目 GPT Academic，目前 60.2k Star！
</p>

<p>
GitHub: <a href="https://github.com/binary-husky/gpt_academic">https://github.com/binary-husky/gpt_academic</a>
</p></li>

<li><p>
Intro: 开源离线Notion,支持本地LLM，JavaScript自定义功能
</p>

<p>
Source: <a href="https://github.com/mayneyao/eidos">https://github.com/mayneyao/eidos</a>  、 <a href="https://eidos.space">https://eidos.space</a>
</p></li>
</ul>
</div>

<div id="outline-container-org0951e8c" class="outline-3">
<h3 id="org0951e8c">PDF相关</h3>
<div class="outline-text-3" id="text-org0951e8c">
<p>
PDF转Markdown 方案
</p>

<ol class="org-ol">
<li>document-convert（开源）：<a href="https://github.com/multimodal-art-projection/MAP-NEO/tree/main/Matrix/document-convert">https://github.com/multimodal-art-projection/MAP-NEO/tree/main/Matrix/document-convert</a></li>
<li>Ragflow（开源）：<a href="https://github.com/infiniflow/ragflow">https://github.com/infiniflow/ragflow</a></li>
<li>gptpdf（开源）：<a href="https://github.com/CosmosShadow/gptpdf">https://github.com/CosmosShadow/gptpdf</a></li>
<li>百度云Textmind（闭源）：<a href="https://cloud.baidu.com/product/textmind.html">https://cloud.baidu.com/product/textmind.html</a></li>
<li>doc2x（闭源）：<a href="https://doc2x.noedgeai.com/">https://doc2x.noedgeai.com</a></li>
<li>腾讯云文档解析（闭源）：<a href="https://cloud.tencent.com/document/product/1759/107504">https://cloud.tencent.com/document/product/1759/107504</a></li>
<li>marker（开源）：<a href="https://github.com/VikParuchuri/marker">https://github.com/VikParuchuri/marker</a></li>
<li>PDF-Extract-Kit（开源）：<a href="https://github.com/opendatalab/PDF-Extract-Kit">https://github.com/opendatalab/PDF-Extract-Kit</a></li>
<li>zerox（开源）：<a href="https://github.com/getomni-ai/zerox">https://github.com/getomni-ai/zerox</a></li>
<li>OminiParse（开源）：<a href="https://github.com/adithya-s-k/omniparse">https://github.com/adithya-s-k/omniparse</a></li>
<li>MinerU（开源）：<a href="https://github.com/opendatalab/MinerU">https://github.com/opendatalab/MinerU</a></li>
</ol>
</div>
</div>
</div>
<div class="taglist"><a href="https://www.vandee.art/tags.html">Tags</a>: <a href="https://www.vandee.art/tag-tool.html">Tool</a> <a href="https://www.vandee.art/tag-useful.html">Useful</a> </div></div>
<div id="postamble" class="status"><div id="search-results"></div>
      <footer>
         <p>
            © 2022-<script>document.write(new Date().getFullYear())</script> Vandee. All rights reserved.
         </p>
        <div class="social-links"></div>
      </footer>

      <a href="#top" aria-label="go to top" title="Go to Top (Alt + G)"
         class="top-link" id="top-link" accesskey="g">
         <i class="fa-solid fa-angle-up fa-2xl"></i>
      </a>

      <script>
        var mybutton = document.getElementById('top-link');
        window.onscroll = function () {
            if (document.body.scrollTop > 800 || document.documentElement.scrollTop > 800) {
                mybutton.style.visibility = 'visible';
                mybutton.style.opacity = '1';
            } else {
                mybutton.style.visibility = 'hidden';
                mybutton.style.opacity = '0';
            }
        };
      </script></div>
</body>
</html>
